[{
        "id": 1,
        "title": "Memes-Generator",
        "description": "Aplikacja, której zadaniem jest wyświetlenie memów, które pobierane są poprzez API, wyszukania go (wyszukiwanie ze względu na wpisane słowo, ale także dostępna jest \"drop-down lista\", która zawiera interesujące użytkownika memy), a następnie możliwości utworzenia własnego mema (liczba tekstów w obrazku jest różna i zależy od tego na ile dany mem pozwala). Głównie wykorzystywane jest REST API i Routing (REACT, REST API, Routing, HTML, CSS, SASS).",
        "link": "https://piokl.github.io/Memes-Generator/"
    },
    {
        "id": 2,
        "title": "ToDoRedux",
        "description": "ToDo lista (CRUD) utworzona przede wszystkim za pomocą Reduxa, ale również zostało wykorzystane Context API, Hooksy oraz localstorage, w celu zapisaniu zmian wprowadzonych w aplikacji mimo odświeżenia strony. Zawiera opcję wyszukiwania każdego zadania, pofiltrowania zadań według kategorii, wykonania. W trakcie tworzenia użyłem: React, Redux, Context API, Hooks, localstorage, HTML, CSS, SASS.",
        "link": "https://piokl.github.io/ToDoRedux/"
    },
    {
        "id": 3,
        "title": "Hamburger",
        "description": "Aplikacja umożliwiająca stworzenie własnego burgera. Głównie wykorzystywane jest w niej Context API wraz z Hookami w celu stworzenia zmiany języka aplikacji, trybu ciemnego/jasnego, używania składników w różnych komponentach, czy dodawania składników do zamówienia i ich usuwania. W trakcie tworzenia użyłem: React, Hooks, Context API, Multiple Languages, HTML, CSS, SASS.",
        "link": "https://piokl.github.io/Hamburger/"
    },
    {
        "id": 4,
        "title": "REST-Countries-API",
        "description": "Aplikacja ma za zadanie wyświetlić dany kraj z jego danymi. Kliknięcie w dany kraj spowoduje przeniesienie się do szczegółowych danych kraju. W aplikacji zostało wykorzystane API w celu pobrania danych, istnieje możliwość wyszukiwania, filtrowania krajów, włączenia jasnego i ciemnego motywu. Aplikacja wykorzystuje także Routing. W trakcie tworzenia użyłem: React, API, Routing, HTML, CSS, SASS.",
        "link": "https://piokl.github.io/REST-Countries-API/"
    },
    {
        "id": 5,
        "title": "Job-listings-with-filtering",
        "description": "Głównym zadaniem aplikacji jest możliwość wyszukania interesującej oferty pracy. Zawiera filtry, które pomagają wszukać daną ofertę na podstawie wybranych kategorii. W aplikacji utworzyłem własne API (https://jsonbin.io/), w którym trzymane są dane dotyczące ofert w formacie json. Wykorzystuję tu także Hooksy i axiosa (React, Hooks, Axios, API, HTML, CSS, SASS).",
        "link": "https://piokl.github.io/Job-listings-with-filtering/"
    },
    {
        "id": 6,
        "title": "DrinkSearchApp",
        "description": "Aplikacja ma za zadanie wyszukania interesującego użytkownika drinka. Każdy drink zawiera zdjęcie, sposób przygotowania, wymagane składniki, a także słowniczek wyjaśniający wartość danych jednostek. Dane są pobierane poprzez Rest API.",
        "link": "https://piokl.github.io/DrinkSearchApp/"
    },
    {
        "id": 7,
        "title": "Rock-Paper-Scissors-Game",
        "description": "Gra papier, kamień, nożyce z możliwością wybrania rozszerzonej wersji (papier, kamień, nożyce, jaszczurka, spock). Aplikacja działa na zasadzie wyboru gracza, a następnie losowego wyboru komputera. Czas wyboru przeciwnika AI jest celowo opóźniony, aby dać złudzenie jego \"myślenia\", w trakcie losowania wyboru występuje animacja. Wykorzystywałem w trakcie tworzenia:  React, HTML, CSS, SASS.",
        "link": "https://piokl.github.io/Rock-Paper-Scissors-Game/"
    },
    {
        "id": 8,
        "title": "HangMan-Game",
        "description": "Gra \"wisielec\", która polega na odgadnięciu nazwy zwierzęcia. Użytkownik ma do wyboru klawiaturę, która pokazuje jego prawidłowe, jak i złe wybory (odpowiednio kolor zielony i czerwony). W trakcie gry zliczane są punkty, pięć złych wyborów oznacza przegraną, a każdy zły wybór do dodatkowy element rysunku \"wisielca\". Wykorzystywałem w trakcie tworzenia:  React, HTML, CSS, SASS, BOOTSTRAP 4.",
        "link": "https://piokl.github.io/HangMan-Game/"
    },
    {
        "id": 9,
        "title": "ToDoList-React",
        "description": "Klasyczna ToDo lista utworzona w React, a zarazem moja pierwsza aplikacja utworzona w React.",
        "link": "https://piokl.github.io/ToDoList-React/"
    }

]